
def area(a, b):
    '''
    Возвращает площадь прямоугольника с длиной a и шириной b
    
        Параметры:
            a - длина прямоугольника
            b - ширина прямоугольника

        Возвращаемое значение:
            Площадь прямоугольника с длиной a и шириной b

        Примеры вызова:
            area(2, 4) # 8
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника с длиной a и шириной b

        Параметры:
            a - длина прямоугольника
            b - ширина прямоугольника

        Возвращаемое значение:
            Периметр прямоугольника с длиной a и шириной b

        Примеры вызова:
            perimeter(3, 6) # 18
    '''
    return (a + b) * 2
