
def area(a):
    '''
    Возвращает площадь квадрата со стороной a
    
        Параметры:
            a - сторона квадрата

        Возвращаемое значение:
            Площадь квадрата со стороной a

        Примеры вызова:
            area(2) # 4
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a

        Параметры:
            a - сторона квадрата

        Возвращаемое значение:
            Периметр квадрата со стороной a

        Примеры вызова:
            perimeter(3) # 12
    '''
    return 4 * a
